{"01---Projects/Christmas-Time/Code-Of-Christmas-Project-Schema":{"slug":"01---Projects/Christmas-Time/Code-Of-Christmas-Project-Schema","filePath":"01 - Projects/Christmas Time/Code Of Christmas Project Schema.md","title":"Code Of Christmas Project Schema","links":[],"tags":[],"content":"Main Page\nRoute Schema → /\nA simple page that says greetings to the user\nProgress\n\n Creating the base route\n Returning the complete data\n\nChallenges page\nRoute Schema → /challanges/&lt;year&gt;\nShows all challenges of that year\nProgress\n\n Creating the base route\n Creating the internal implementation\n Creating the error diagonal system\n Getting data from the database\n returning the complete data\n\nChallenge Page\nRoute Schema → /challenge/&lt;year&gt;/&lt;challenge_id&gt;\nThis will show the year’s Challenge base on challenge ID.\nThis page will have an input section to enter the answer and answer will get validate with Answer route\nProgress\n\n Creating the base route\n Creating the internal implementation\n Creating the error diagonal system\n Getting data from the database\n returning the complete data\n\nAnswer\nRoute Schema → /validate/&lt;year&gt;/&lt;challenge_id&gt;\nthis page will validate the answer base on a POST request to the API\nProgress\nOverall\n\nAll pages return HTMX content.\nUser answers are all text based (at least for first versions)\n5 answer in 1 minute and others will be blocked for 1 minute\n\n"},"01---Projects/Eikoakiba/Eikoakiba-personal-website":{"slug":"01---Projects/Eikoakiba/Eikoakiba-personal-website","filePath":"01 - Projects/Eikoakiba/Eikoakiba personal website.md","title":"Eikoakiba personal website","links":[],"tags":[],"content":"Well, I think it’s time to make a svelte website for myself instead of just creating static pages over and over again.\nIt has the same style as my static (main) space with just a little bit change.\nIt’s going to be close to the personal site of isak.me developer but with my own taste of web.\nAs i said i don’t want to over-complicated and it should be simple and minimal, I just want to make it reactive to add more feature into it and make it more beautiful.\nmaybe why I wanna change my main site, and not just the dev site:\n\nAs separating the ‘dev’ website is not a good thing, cause I think it should be a part of my own space, and for all other technical stuff we can refer the user to my github page, I think dev website should be a part of my main website\nthe main website is not doing any special thing, honestly I think i got bored with it and now I wanna do something bigger and better. with the access to the node runtime now we can make cool thing and use things like tailwind without any problem :&gt;.\nI can automate the entire process by writing JS, which is a bit better in the case of readability and community (I still wanna use bash too lol).\nIt can be even a project my own :)\n\nI will do this with Svelte because I respect minimalism :&gt;"},"01---Projects/Pony/Pony---Static-diary-system":{"slug":"01---Projects/Pony/Pony---Static-diary-system","filePath":"01 - Projects/Pony/Pony - Static diary system.md","title":"Pony - Static diary system","links":[],"tags":[],"content":"Description\nIt’s an feature rich static HTML generation program, but with some tweaks for create special and easy to use/maintain diary systems.\nThe goal would be to use the program to make personal diary web pages that runs everywhere without any overhead and complex scripting system (keep everything static as much as we can) and make a way to modify and update them easier than anytime.\nThis program should focus on the concepts of the diary, you can read more about the main concept here: What is a diary notebook/system. with respect to the meaning of the core concept, This is not an general purpose static web page generation tool its goal is to be specific about diary system characteristics and make them more easier to use.\nThe input of the program should be these things:\n\nDiary pages template\nDiary pages styling\nDiary pages content\nInternal software configs\n\nThe output of the program should be these things:\n\nCompiled Diary pages\nCompiled Diary states\nDebug mode diary test cases\n\nDiary pages styling\nProviding styling for template diary pages. Pony will use CSS files in respect of how HTML works.\nConcepts:\n\nBasic page styling (built-in)\nAdvance page styling (by user)\n\nBasic page styling\nPony provides basic styling implementations as built-on and default CSS files. you can find them inside your diary project styles/global folder with each of built-in files have default_ prefix on them.\nAlso note it’s not good to change default styling files, in the case that you want to have your own styles, please refer to the Advance page styling\nAdvance page styling\nPony also provides advance diary styling. You can add your own CSS files to the project and link them to your HTML templates. It’s as easy as styling HTML files.\nDiary pages template\nAn HTML page with custom styling as diary template. These pages have this important/optional features\n\nDiary content placeholders (built-in)\nDynamic custom scripting (built-in, OPTIONAL)\n\nGoals\nImplementations concepts\nMAYBE: a very simple scripting system that is even more simpler than HTML\nit takes the content of the diary system with some special styling tags\nit may be like this:\nINCLUDE (Date)\n \n# This is how you can make comments\n \n# you can write text anywhere on the PonyScript\n--text &lt;Text-Align (right, left, center, beside)) # Default is _left_\nSo this is my diary for this example\nand this is my today image\n--img &lt;image_name&gt; &lt;Align_mode (right, *left, center, beside)&gt; &lt;Rotation (right, *left)&gt; &lt;Effect (etc)&gt;\nAnd yea that was a great day\n \nTODO;"},"01---Projects/Untitled":{"slug":"01---Projects/Untitled","filePath":"01 - Projects/Untitled.md","title":"Untitled","links":[],"tags":[],"content":"hello"},"01---Projects/psm/AI-Advertise-1":{"slug":"01---Projects/psm/AI-Advertise-1","filePath":"01 - Projects/psm/AI Advertise 1.md","title":"AI Advertise 1","links":[],"tags":[],"content":"Hello! That’s a great project to work on for learning Rust and cryptography! Let’s discuss your file-based storage design and potential improvements.\n💾 File vs. Database Storage\nRegarding your question about using individual files (folder + files) versus a database:\nThe approach of using AES-encrypted files for your data is a good and common approach for a minimal, local password manager (like the Unix pass or KeePass).\n✅ Advantages of Encrypted Files:\nSimplicity and Minimal Dependencies: You avoid adding a database engine (like SQLite) dependency, making your project lighter and easier to manage. This aligns well with your goal of making it minimal.\n\nSecurity (with proper encryption): Since all the files are encrypted with AES, they are just as secure as an encrypted database file—provided your master key derivation (using a KDF like Argon2) is strong and your AES implementation (e.g., using AES-256-GCM) is sound.\n\nEasy Backup/Sync: The user only needs to back up/sync the entire directory of encrypted files.\n\n⚠️ Disadvantage of Encrypted Files:\nMetadata Leakage: This is the biggest security concern with a file-per-entry system. Even though the contents of your password files are encrypted, the filenames, directory names, file sizes, and timestamps are often visible to an attacker who compromises the file system but not your encryption key.\n\n    Example: If you name your files after the service (e.g., github.pass, bank.pass), an attacker instantly knows the list of all services you have accounts for.\n\nPerformance: For a large number of entries, iterating over hundreds or thousands of files in a directory can be slower than querying a single database file.\n\n💡 Recommendation: Use a Single Encrypted Vault File\nTo maintain simplicity but solve the metadata leakage problem, the most popular approach for local managers is to use a single, encrypted file (a “vault”) that contains all your password entries and metadata (like the KeePass .kdbx format).\nThis way, an attacker only sees one file with a generic name (e.g., vault.bin or psm.dat), and all metadata (service names, usernames, etc.) are hidden within the file’s encrypted contents.\n🚀 Suggested Project Improvements\nHere are some improvements and best practices to consider for your Rust password manager:\n\n\n🛡️ Cryptographic Best Practices\nKey Derivation Function (KDF): Ensure you are using a modern, memory-hard, and time-costly KDF like Argon2 (specifically Argon2id) to derive the strong encryption key from the user’s master password. Hashing the master password directly (like with SHA-256) is not secure enough.\n Check: Are you using a KDF with an appropriate salt, iterations/time cost, memory cost, and parallelism settings?\n\nAuthenticated Encryption: Ensure you are using an authenticated encryption mode for AES, like AES-256-GCM. This not only encrypts the data but also provides an integrity check (a MAC) to ensure the encrypted data hasn’t been tampered with. It looks like you’re using aes_gcm, which is great!\n\n\n📝 Secret Handling in Memory\nMemory Zeroing: Sensitive data, like the master password or decrypted passwords, should be zeroed out (overwritten with zeroes) from memory as soon as they are no longer needed. This prevents them from being unintentionally leaked by memory inspection or saved to disk in hibernation/swap files.\n Rust Crates: Look into crates like zeroize or secrecy that provide wrapper types (like Secret&lt;T&gt;) to handle memory zeroing automatically upon drop.\n\nCommand Line Argument Security: Never accept the master password as a direct command-line argument (e.g., psm login —password “my_pass”). Command-line arguments can be read by other users on the system (via ps aux or Task Manager) and are often saved in shell history files.\n Solution: Use interactive prompt for the master password (e.g., using a crate like rpassword to read the input securely without echoing) or read it from standard input (stdin).\n\n\n\n✨ Usability and Features\nPassword Generation: A password manager is incomplete without a built-in strong, random password generator. This is a high-value feature for security and convenience.\nClipboard Management: Implement logic to copy the decrypted password to the clipboard and then automatically clear the clipboard after a short timeout (e.g., 30-60 seconds). This mitigates the risk of the password being left in the clipboard buffer.\n\n\nI hope this helps you move forward with your awesome project!\nWould you like me to look into a specific section of your code (e.g., how you handle the master password or the encryption) to provide more targeted feedback?\nBy the way, to unlock the full functionality of all Apps, enable Gemini Apps Activity."},"01---Projects/psm/psm":{"slug":"01---Projects/psm/psm","filePath":"01 - Projects/psm/psm.md","title":"psm","links":[],"tags":[],"content":"Current Progress\nChange-logs\nIdeas\n\nuse a ‘vault’ like file instead of saving all password inside a folder, because we could have metadata leaking system.\nuse interactive command line approach instead of per-line things, because the shell often save the commands and this can be bad.\nbuild-in password generation\nturn passwords into structures and then make them bincode binary to encode them to AES and then save them.\nuse ‘crab’ for argument reading system2\n\nBug Fixes\n\nProject will have a re-write\n"},"02---Blogs/blogs":{"slug":"02---Blogs/blogs","filePath":"02 - Blogs/blogs.md","title":"blogs","links":["02---Blogs/web/Let's-have-a-talk..."],"tags":[],"content":"Here is a visual list of all my blogs\nweb\n\nLet’s have a talk…\n"},"02---Blogs/web/Let's-have-a-talk...":{"slug":"02---Blogs/web/Let's-have-a-talk...","filePath":"02 - Blogs/web/Let's have a talk....md","title":"Let's have a talk...","links":[],"tags":[],"content":"Hello and Hello after a while! I’m here again and writing blogs to talk about my inner thoughts Xd.\nWell let’s be honest everything changed and I think I’m growing like a real person (at least I hope so)\nI made a blog post about my tend to make games, well… it didn’t go well in some senses. First of all, I really like the game development and I believe I need more learning curves for it xd. But the thing is… right now I can’t make any effort from it. I really like the programming side of it and this is not actually enough for someone who is not great at art, I know learning &amp; trying can make the best of the best, but it’s not for me right now. But the thing is… I still make games in my free times, and I still love the process as I always do.\nBut you may ask, Ok eiko… but what do you do now? well it’s a great question, I returned to back-end development xd, Yea you hear it right, I’m going to start the process from zero (I did started btw) and try to fill the gaps that I had and call myself a back-end developer. It’s patient and some logical reasons in the same time. patient because I like it obviously and logical reasons are things like financial situation and some other things. Yes that gd financial situation!. I don’t know you noticed this before, making games is not great for someone who needs money (Specially if you didn’t used to it) and wants to actually do something that has financial future. It’s great that some games sell for millions and dollars but the thing is… it’s not a promise job, and you may not gain anything at all!\nBut again, I will do it as hobby and maybe someday I made something cool and exciting :).\nOh well, let’s more talk about the concepts instead of my situation. I started back-end developing as a hobby because I wanted to make my website more interactive to others. I did some PHP and I switched to Flask, A simple minimal (Maybe it’s feature rich right now, idk) python library to work with web servers. It was find for me and I liked to do anything by my own. That was not a problem for that old version of me, because I was literally 14 or 15 years old, and imagine how much you could do without the how much fun you could have with a minimal architecture library that lets you do anything by your own. but that same reason, made me a very strict person in the sense of learning things. I used to be a programming that wants to do anything without using libraries and ready-to-go frameworks. that’s why I have never learned Django, Another python framework for back-end stuff. after some years (now i’m 21) I can feel this pressure that the right option is to learn by standard and try to understand that there is some code that is more well structures than mind and sometime I need to calm down and let others do magical stuff for me. yea… it has been very hard for me to change, but I’m trying. All of the things that i said was the bridge to learn more love level stuff and trying to do anything by my own. that’s why I started learning C/C++ after python and step inside the real stuff. I learned C, Make, C++, low level compiler concepts like compiler, linking, dynamic libraries, etc. and I forgot that I need to continue learn the thing that I started, back-end development\nI always liked the concept of back-end development. It feels like you are writing real software (i’m sorry front-end guys, I’m not just not good at speaking Xd) and you can so cool stuff. Same stuff that you do on your system-base programs and just turn them into a web application. Literally just work with I/O data that comes and goes as HTTP requests. you have an interface that works with HTTP (or maybe you are supporting more network protocols) and you have your main code that works by anything (F.g creating online game logic). that is a great thing cause now you write software and you connect it to some sort of network stack that can open new gates of ideas for you. That’s why I love back-end development and it feels good to do it.\nI did some projects related to web development and learned one of the biggest things in my life, Golang. It’s very funny cause I learned it just because I wanted to learn something new and volla, it just made me a different person. But you may guess why I like it since I explained that I’m a person who likes minimalism. after learning golang I decided to do more projects (I’m talking about 1 year ago) and I did some. But the thing is I still didn’t learned it the way I should. I just learn interested things of it and made some projects, but this is not enough for someone to be a real Software engineer. Now, in these days I decided to start over and grow from basic stuff to professional concepts and fill that gap for myself. For sure I can learn more quickly as I have some background in this profession. I have been struggling with some thoughts like maybe i’m late. But the reality is you start from a point and get better at that point, it doesn’t matter when you start, it matter how you keep going and how much patient you are. If you don’t start now you will say: I wish I started before and this is though alone can make more nested thoughts like maybe i’m late. No, you are not late. you just need to start right now and prevent yourself saying that thing again in the future. Well i can say it is working for me now. I feel better and I feel like I a goal in my life.\nWell Hope you’ll have a great time, and like always, Happy Coding"},"03---Notes/test-note-for-this-file":{"slug":"03---Notes/test-note-for-this-file","filePath":"03 - Notes/test note for this file.md","title":"test note for this file","links":[],"tags":[],"content":"Hello this is my test note"},"04---Diary/diary":{"slug":"04---Diary/diary","filePath":"04 - Diary/diary.md","title":"diary","links":[],"tags":[],"content":"Hello, I just think I need to make the website more fun and reactive. I did static website for too long and now it’s time make this website more fun but still use the same layout and themes but make it 1 page website (like using reactive frameworks). I think i’ll use svelte for this project, since I want to learn it and it’s going to be a good first project for me."},"Home":{"slug":"Home","filePath":"Home.md","title":"Home","links":[],"tags":[],"content":"Hello! my name is Fractuna and this is my diary system.\nI do: Programming, Music. \nI like: Reading/Writing, Aesthetics, Old techs, Silence.\nTech Faves: Back-end programming, Game Development, Open Source, Unix/Linux.\nI really like writing, formatting and structuring my thoughts through writing. it makes me calm and more focused. That’s why my main website is nothing but my notes. Well my primary focus is not not distracted by modern internet AI bots and consume/provide valuable contents;"},"index":{"slug":"index","filePath":"index.md","title":"index","links":[],"tags":[],"content":"Hello! my name is Fractuna and this is my diary system.\nI do: Programming, Music. \nI like: Reading/Writing, Aesthetics, Old techs, Silence.\nTech Faves: Back-end programming, Game Development, Open Source, Unix/Linux.\nI really like writing, formatting and structuring my thoughts through writing. it makes me calm and more focused. That’s why my main website is nothing but my notes. Well my primary focus is not not distracted by modern internet AI bots and consume/provide valuable contents;"}}